In [2]:
import json
import sqlite3
import pandas as pd
import os

In [3]:
class SpiderDataset:
    def __init__(self, dataset_path):
        self.dataset_path = dataset_path
        self.train_data = self.load_json('train_spider.json')
        self.dev_data = self.load_json('dev.json')
        self.schema_data = self.load_json('tables.json')

    def load_json(self, filename):
        with open(os.path.join(self.dataset_path, filename), 'r') as file:
            return json.load(file)

    def get_schema_by_db_id(self, db_id):
        for schema in self.schema_data:
            if schema['db_id'] == db_id:
                return schema
        return None

    def get_db_path(self, db_id):
        return os.path.join(self.dataset_path, 'database', db_id, f'{db_id}.sqlite')

    def execute_query(self, db_id, query):
        db_path = self.get_db_path(db_id)
        conn = sqlite3.connect(db_path)
        cursor = conn.cursor()
        try:
            cursor.execute(query)
            result = cursor.fetchall()
            columns = [desc[0] for desc in cursor.description]
            return pd.DataFrame(result, columns=columns)
        except sqlite3.Error as e:
            print(f"Execution error: {e}")
            return None
        finally:
            cursor.close()
            conn.close()

In [4]:
dataset = SpiderDataset('./dataset')

# Load a sample query from dev dataset
sample_query = dataset.train_data[1]
question = sample_query['question']
gold_sql = sample_query['query']
db_id = sample_query['db_id']
schema = dataset.get_schema_by_db_id(db_id)

print("Question:", question)
print("Gold SQL:", gold_sql)
print("Schema:", schema)

# Executing a query on the Spider sample DB
result_df = dataset.execute_query(db_id, gold_sql)
if result_df is not None:
    print(result_df.head())
else:
    print("Query execution failed.")

df_final = pd.DataFrame(columns=['gold', 'db_id'])
for i in range(100):
    sample_query = dataset.train_data[i]
    df_final.loc[i] = [sample_query['query'], sample_query['db_id']]

    
df_final

Question: List the name, born state and age of the heads of departments ordered by age.
Gold SQL: SELECT name ,  born_state ,  age FROM head ORDER BY age
Schema: {'column_names': [[-1, '*'], [0, 'department id'], [0, 'name'], [0, 'creation'], [0, 'ranking'], [0, 'budget in billions'], [0, 'num employees'], [1, 'head id'], [1, 'name'], [1, 'born state'], [1, 'age'], [2, 'department id'], [2, 'head id'], [2, 'temporary acting']], 'column_names_original': [[-1, '*'], [0, 'Department_ID'], [0, 'Name'], [0, 'Creation'], [0, 'Ranking'], [0, 'Budget_in_Billions'], [0, 'Num_Employees'], [1, 'head_ID'], [1, 'name'], [1, 'born_state'], [1, 'age'], [2, 'department_ID'], [2, 'head_ID'], [2, 'temporary_acting']], 'column_types': ['text', 'number', 'text', 'text', 'number', 'number', 'number', 'number', 'text', 'text', 'number', 'number', 'number', 'text'], 'db_id': 'department_management', 'foreign_keys': [[12, 7], [11, 1]], 'primary_keys': [1, 7, 11], 'table_names': ['department', 'head', 'management'], 'table_names_original': ['department', 'head', 'management']}
                 name   born_state   age
0  Pádraig Harrington  Connecticut  43.0
1        Stewart Cink      Florida  50.0
2         Dudley Hart   California  52.0
3        Jeff Maggert     Delaware  53.0
4          Nick Faldo   California  56.0

                                                 gold                  db_id
0          SELECT count(*) FROM head WHERE age  >  56  department_management
1   SELECT name ,  born_state ,  age FROM head ORD...  department_management
2   SELECT creation ,  name ,  budget_in_billions ...  department_management
3   SELECT max(budget_in_billions) ,  min(budget_i...  department_management
4   SELECT avg(num_employees) FROM department WHER...  department_management
..                                                ...                    ...
95  SELECT course_name FROM courses ORDER BY cours...     student_assessment
96  SELECT course_name FROM courses ORDER BY cours...     student_assessment
97  SELECT first_name FROM people ORDER BY first_name     student_assessment
98  SELECT first_name FROM people ORDER BY first_name     student_assessment
99  SELECT student_id FROM student_course_registra...     student_assessment

[100 rows x 2 columns]

In [12]:
df_final.to_csv("gold.tsv", sep='\t', index=False, header=False)

In [44]:
df5 = pd.read_csv("gold.csv")
df5

ParserError: Error tokenizing data. C error: Expected 3 fields in line 3, saw 5

In [5]:
df2 = pd.read_csv("text2sql_results_fewshot.csv")
#df1 = pd.read_csv("control_results.csv")
#df2 = df2.iloc[2:]
#df2 = df2.reset_index(drop=True)
df2

,query_id,question,schema,agent_1_output,agent_2_output,agent_3a_output_1,agent_3b_output_1,execution_output_1,agent_3c_output_1,agent_3a_output_2,agent_3b_output_2,execution_output_2,agent_3c_output_2,agent_3a_output_3,agent_3b_output_3,execution_output_3,agent_3c_output_3,final_query
0,0,How many heads of the departments are older th...,"{'column_names': [[-1, '*'], [0, 'department i...",Tables - head; Columns - age; Ambiguities - None,SELECT COUNT(*) FROM head WHERE age > 56;,The SQL query doesn't have any syntax issues.,{},"(True, COUNT(*)\n0 5)",SATISFACTORY SQL QUERY GENERATED\nSELECT COUNT...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT COUNT(*) FROM head WHERE age > 56;
1,1,"List the name, born state and age of the heads...","{'column_names': [[-1, '*'], [0, 'department i...","Tables - head, management; Columns - name, bor...","SELECT head.name, head.born_state, head.age FR...","The SQL query syntax is correct, there are no ...",{},"(True, name born_state ag...",SATISFACTORY SQL QUERY GENERATED\nSELECT head....,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT head.name, head.born_state, head.age FR..."
2,2,"List the creation year, name and budget of eac...","{'column_names': [[-1, '*'], [0, 'department i...","Tables - department; Columns - creation, name,...","SELECT creation, name, budget in billions FROM...","Issue: The phrase ""in billions"" is not a valid...",{},"(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nCorrecte...,"The given SQL query: SELECT creation, name, `b...",{},"(False, 'Query execution failed.')",SATISFACTORY SQL QUERY GENERATED\nSELECT creat...,NaN,NaN,NaN,NaN,"Corrected SQL Query: SELECT creation, name, `b..."
3,3,What are the maximum and minimum budget of the...,"{'column_names': [[-1, '*'], [0, 'department i...",Tables - department; Columns - budget in billi...,"SELECT MAX(`budget in billions`), MIN(`budget ...","The SQL query syntax appears to be correct, th...",{},"(False, 'Query execution failed.')",SATISFACTORY SQL QUERY GENERATED\nSELECT MAX(`...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT MAX(`budget in billions`), MIN(`budget ..."
4,4,What is the average number of employees of the...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - department; Columns - num employees, ...",SELECT AVG(`num employees`) FROM department WH...,There are no SQL syntax issues in the given qu...,{},"(False, 'Query execution failed.')",SATISFACTORY SQL QUERY GENERATED\n\nSELECT AVG...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT AVG(`num employees`) FROM department WH...
5,5,What are the names of the heads who are born o...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - head; Columns - name, born state; Amb...",SELECT name FROM head WHERE born_state != 'Cal...,The SQL query syntax is correct.,{},"(True, name\n0 Tiger ...",SATISFACTORY SQL QUERY GENERATED\nSELECT name ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT name FROM head WHERE born_state != 'Cal...
6,6,What are the distinct creation years of the de...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - department, head, management; Columns...",SELECT DISTINCT department.creation \nFROM dep...,The issue is with the space in the column name...,"{""department.department id"": ""department.depar...","(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nSELECT D...,The SQL query does not have any syntax issues.,{},"(True, Creation\n0 1903)",SATISFACTORY SQL QUERY GENERATED\nSELECT DISTI...,NaN,NaN,NaN,NaN,SELECT DISTINCT department.creation \nFROM dep...
7,7,What are the names of the states where at leas...,"{'column_names': [[-1, '*'], [0, 'department i...",Tables - head; Columns - born_state; Ambiguiti...,SELECT born_state FROM head GROUP BY born_stat...,The SQL query syntax appears to be correct wit...,{},"(True, born_state\n0 California)",SATISFACTORY SQL QUERY GENERATED\nSELECT born_...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT born_state FROM head GROUP BY born_stat...
8,8,In which year were most departments established?,"{'column_names': [[-1, '*'], [0, 'department i...",Tables - department; Columns - creation; Ambig...,"SELECT creation, COUNT(*) FROM department GROU...",The SQL query syntax appears to be correct wit...,{},"(True, Creation COUNT(*)\n0 1789 ...",SATISFACTORY SQL QUERY GENERATED\n\nSELECT cre...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT creation, COUNT(*) FROM department GROU..."
9,9,Show the name and number of employees for the ...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - department, head, management; Columns...","SELECT department.name, department.num employe...",The issues in the SQL query are:\n\n1. The col...,"{""department.num employees"": ""department.num_e...","(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nSELECT d...,The SQL query does not have any syntax issues.,{},"(True, Name Num_Employees\n0 ...",SATISFACTORY SQL QUERY GENERATED\n\nSELECT dep...,NaN,NaN,NaN,NaN,"SELECT department.name, department.num_employe..."
10,10,How many acting statuses are there?,"{'column_names': [[-1, '*'], [0, 'department i...",Tables - management; Columns - temporary actin...,SELECT COUNT(*) FROM management;,"The given SQL query ""SELECT COUNT(*) FROM mana...",{},"(True, COUNT(*)\n0 5)",SATISFACTORY SQL QUERY GENERATED\nSELECT COUNT...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT COUNT(*) FROM management;
11,11,How many departments are led by heads who are ...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - department, head, management; Columns...",SELECT COUNT(*) FROM department WHERE departme...,"The issue is with the spacing in ""department i...","{""department id"": ""Department_ID""}","(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nSELECT C...,The SQL query does not have any syntax issues.,{},"(True, COUNT(*)\n0 11)",SATISFACTORY SQL QUERY GENERATED\nSELECT COUNT...,NaN,NaN,NaN,NaN,SELECT COUNT(*) FROM department WHERE departme...
12,12,What are the distinct ages of the heads who ar...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - head, management; Columns - age, temp...",SELECT DISTINCT head.age FROM head JOIN manage...,The SQL query does not have any syntax issues.,{},"(True, Empty DataFrame\nColumns: [age]\nIndex:...",SATISFACTORY SQL QUERY GENERATED\nSELECT DISTI...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT DISTINCT head.age FROM head JOIN manage...
13,13,List the states where both the secretary of 'T...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - department, head, management; Columns...",SELECT h.born_state \nFROM department d \nJOIN...,The SQL query seems to have no syntax issues. ...,"{""d.department id"": ""d.department_id"", ""m.depa...","(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nSELECT h...,The SQL query does not have any syntax issues.,{},"(True, born_state\n0 Delaware\n1 Califo...",SATISFACTORY SQL QUERY GENERATED\n\nSELECT h.b...,NaN,NaN,NaN,NaN,SELECT h.born_state \nFROM department d \nJOIN...
14,14,Which department has more than 1 head at a tim...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - department, head, management; Columns...","SELECT department.id, department.name, COUNT(m...",The SQL query appears to be correct with no sy...,{},"(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nSELECT d...,The SQL query appears to be syntactically corr...,{},"(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nSELECT d...,The SQL query appears to be syntactically corr...,{},"(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\n\nSELECT d...,"SELECT department.id, department.name, COUNT(m..."
15,15,Which head's name has the substring 'Ha'? List...,"{'column_names': [[-1, '*'], [0, 'department i...","Tables - head; Columns - head id, name; Ambigu...","SELECT head.id, head.name FROM head WHERE head...","The SQL query syntax appears to be correct, th...",{},"(False, 'Query execution failed.')",SATISFACTORY SQL QUERY GENERATED\nSELECT head....,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT head.id, head.name FROM head WHERE head..."
16,16,How many farms are there?,"{'column_names': [[-1, '*'], [0, 'city id'], [...",Tables - farm; Columns - farm id; Ambiguities ...,SELECT COUNT(*) FROM farm,The given SQL query has no syntax issues.,{},"(True, COUNT(*)\n0 8)",SATISFACTORY SQL QUERY GENERATED\nSELECT COUNT...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT COUNT(*) FROM farm
17,17,Count the number of farms.,"{'column_names': [[-1, '*'], [0, 'city id'], [...",Tables - farm; Columns - farm id; Ambiguities ...,SELECT COUNT(*) FROM farm,The SQL query doesn't have any syntax issues.,{},"(True, COUNT(*)\n0 8)",SATISFACTORY SQL QUERY GENERATED\nSELECT COUNT...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT COUNT(*) FROM farm
18,18,List the total number of horses on farms in as...,"{'column_names': [[-1, '*'], [0, 'city id'], [...",Tables - farm; Columns - total horses; Ambigui...,SELECT `total horses` FROM farm ORDER BY `tota...,"The SQL query syntax is correct, there are no ...",{},"(False, 'Query execution failed.')",SATISFACTORY SQL QUERY GENERATED\n\nSELECT `to...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT `total horses` FROM farm ORDER BY `tota...
19,19,"What is the total horses record for each farm,...","{'column_names': [[-1, '*'], [0, 'city id'], [...","Tables - farm; Columns - farm id, total horses...","SELECT `farm id`, SUM(`total horses`) FROM far...",The SQL query does not have any syntax issues.,{},"(False, 'Query execution failed.')",SATISFACTORY SQL QUERY GENERATED\n\nSELECT `fa...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT `farm id`, SUM(`total horses`) FROM far..."
20,20,What are the hosts of competitions whose theme...,"{'column_names': [[-1, '*'], [0, 'city id'], [...","Tables - farm competition; Columns - hosts, th...",SELECT hosts FROM farm_competition WHERE theme...,The SQL query does not have any syntax issues.,{},"(True, Hosts...",SATISFACTORY SQL QUERY GENERATED\nSELECT hosts...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT hosts FROM farm_competition WHERE theme...
21,21,Return the hosts of competitions for which the...,"{'column_names': [[-1, '*'], [0, 'city id'], [...","Tables - farm competition; Columns - hosts, th...",SELECT hosts FROM farm_competition WHERE theme...,The SQL query does not have any syntax issues.,{},"(True, Hosts...",SATISFACTORY SQL QUERY GENERATED\nSELECT hosts...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT hosts FROM farm_competition WHERE theme...
22,22,What are the themes of farm competitions sorte...,"{'column_names': [[-1, '*'], [0, 'city id'], [...","Tables - farm competition; Columns - theme, ye...","SELECT theme, year FROM farm_competition ORDER...","The given SQL query: SELECT theme, year FROM f...","{""farm_competition"": ""farm competition""}","(True, Theme Year\n0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT theme...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT theme, year FROM farm_competition ORDER..."
23,23,"Return the themes of farm competitions, sorted...","{'column_names': [[-1, '*'], [0, 'city id'], [...","Tables - farm competition; Columns - theme, ye...",SELECT theme FROM farm_competition ORDER BY ye...,The SQL query does not have any syntax issues.,{},"(True, Theme\n0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT theme...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT theme FROM farm_competition ORDER BY ye...
24,24,What is the average number of working horses o...,"{'column_names': [[-1, '*'], [0, 'city id'], [...","Tables - farm; Columns - total horses, working...",SELECT AVG(working horses) FROM farm WHERE tot...,The SQL query does not have any syntax issues.,{},"(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\nSELECT AVG...,The SQL query does not have any syntax issues.,{},"(True, AVG(`Working_Horses`)\n0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT AVG(`...,NaN,NaN,NaN,NaN,SELECT AVG(`Working_Horses`) FROM farm WHERE `...
25,25,Give the average number of working horses on f...,"{'column_names': [[-1, '*'], [0, 'city id'], [...","Tables - farm; Columns - total horses, working...",SELECT AVG(working horses) FROM farm WHERE tot...,The SQL query does not have any syntax issues.,{},"(False, 'Query execution failed.')",UNSATISFACTORY SQL QUERY GENERATED\nSELECT AVG...,The SQL query does not have any syntax issues.,{},"(True, AVG(`Working_Horses`)\n0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT AVG(`...,NaN,NaN,NaN,NaN,SELECT AVG(`Working_Horses`) FROM `farm` WHERE...
26,26,What are the maximum and minimum number of cow...,"{'column_names': [[-1, '*'], [0, 'city id'], [...",Tables - farm; Columns - cows; Ambiguities - None,"SELECT MAX(cows), MIN(cows) FROM farm;",The SQL query doesn't have any syntax issues.,{},"(True, MAX(cows) MIN(cows)\n0 3987.0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT MAX(c...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT MAX(cows), MIN(cows) FROM farm;"
27,27,Return the maximum and minimum number of cows ...,"{'column_names': [[-1, '*'], [0, 'city id'], [...",Tables - farm; Columns - cows; Ambiguities - None,"SELECT MAX(cows), MIN(cows) FROM farm",The SQL query doesn't have any syntax issues.,{},"(True, MAX(cows) MIN(cows)\n0 3987.0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT MAX(c...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SELECT MAX(cows), MIN(cows) FROM farm"
28,28,How many different statuses do cities have?,"{'column_names': [[-1, '*'], [0, 'city id'], [...",Tables - city; Columns - status; Ambiguities -...,SELECT COUNT(DISTINCT status) FROM city;,The SQL query does not have any syntax issues.,{},"(True, COUNT(DISTINCT status)\n0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT COUNT...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT COUNT(DISTINCT status) FROM city;
29,29,Count the number of different statuses.,"{'column_names': [[-1, '*'], [0, 'city id'], [...",Tables - city; Columns - status; Ambiguities -...,SELECT COUNT(DISTINCT status) FROM city,The SQL query doesn't have any syntax issues.,{},"(True, COUNT(DISTINCT status)\n0 ...",SATISFACTORY SQL QUERY GENERATED\nSELECT COUNT...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,SELECT COUNT(DISTINCT status) FROM city

In [14]:
df_control = pd.DataFrame({
    'prediction': df1['query'],
    'db_id': df_final['db_id']
})

In [15]:
df_control['prediction'] = df_control['prediction'].str.replace('\n', ' ', regex=False)

In [16]:
df_control

                                           prediction                  db_id
0            SELECT COUNT(*) FROM head WHERE age > 56  department_management
1   SELECT head.name, head.born_state, head.age FR...  department_management
2   SELECT creation, name, budget in billions FROM...  department_management
3   SELECT MAX(`budget in billions`), MIN(`budget ...  department_management
4   SELECT AVG(`num employees`) FROM department WH...  department_management
..                                                ...                    ...
95  SELECT course_name FROM courses ORDER BY cours...     student_assessment
96  SELECT course_name FROM courses ORDER BY cours...     student_assessment
97  SELECT `first name` FROM people ORDER BY `firs...     student_assessment
98  SELECT `first name` FROM people ORDER BY `firs...     student_assessment
99  SELECT DISTINCT "student id" FROM "student cou...     student_assessment

[100 rows x 2 columns]

In [7]:
df_text2sql = pd.DataFrame({
    'prediction': df2['final_query'],
    'db_id': df_final['db_id']
})
#df_text2sql['prediction'] = df_text2sql['prediction'].str.replace('\n', ' ', regex=False)

In [11]:
df_text2sql = df_text2sql.iloc[0:30]
df_text2sql

                                           prediction                  db_id
0           SELECT COUNT(*) FROM head WHERE age > 56;  department_management
1   SELECT head.name, head.born_state, head.age FR...  department_management
2   Corrected SQL Query: SELECT creation, name, `b...  department_management
3   SELECT MAX(`budget in billions`), MIN(`budget ...  department_management
4   SELECT AVG(`num employees`) FROM department WH...  department_management
5   SELECT name FROM head WHERE born_state != 'Cal...  department_management
6   SELECT DISTINCT department.creation \nFROM dep...  department_management
7   SELECT born_state FROM head GROUP BY born_stat...  department_management
8   SELECT creation, COUNT(*) FROM department GROU...  department_management
9   SELECT department.name, department.num_employe...  department_management
10                   SELECT COUNT(*) FROM management;  department_management
11  SELECT COUNT(*) FROM department WHERE departme...  department_management
12  SELECT DISTINCT head.age FROM head JOIN manage...  department_management
13  SELECT h.born_state \nFROM department d \nJOIN...  department_management
14  SELECT department.id, department.name, COUNT(m...  department_management
15  SELECT head.id, head.name FROM head WHERE head...  department_management
16                          SELECT COUNT(*) FROM farm                   farm
17                          SELECT COUNT(*) FROM farm                   farm
18  SELECT `total horses` FROM farm ORDER BY `tota...                   farm
19  SELECT `farm id`, SUM(`total horses`) FROM far...                   farm
20  SELECT hosts FROM farm_competition WHERE theme...                   farm
21  SELECT hosts FROM farm_competition WHERE theme...                   farm
22  SELECT theme, year FROM farm_competition ORDER...                   farm
23  SELECT theme FROM farm_competition ORDER BY ye...                   farm
24  SELECT AVG(`Working_Horses`) FROM farm WHERE `...                   farm
25  SELECT AVG(`Working_Horses`) FROM `farm` WHERE...                   farm
26             SELECT MAX(cows), MIN(cows) FROM farm;                   farm
27              SELECT MAX(cows), MIN(cows) FROM farm                   farm
28           SELECT COUNT(DISTINCT status) FROM city;                   farm
29            SELECT COUNT(DISTINCT status) FROM city                   farm

In [12]:
df_text2sql.to_csv("text2sql_fewshot.tsv", sep='\t', index=False, header=False)

In [40]:
df_control.to_csv("control.tsv", sep='\t', index=False, header=False)

In [41]:
print(df_control.iloc[28])

prediction    SELECT COUNT(DISTINCT status) FROM city
db_id                                            farm
Name: 28, dtype: object